agMain.controller('register', function($scope){
	$scope.defaultYearVal = '请选择年';
	$scope.defaultMonthVal = '请选择月';
	$scope.defaultDayVal = '请选择日';
	$scope.selCity = {
				'01':['东城','西城','崇文','宣武','朝阳','丰台','石景山','海淀',
					  '门头沟','房山','通州','顺义', '昌平', '大兴', '平谷', '怀柔', '密云', '延庆'],

				'02':['黄浦', '南区', '卢湾', '徐汇', '长宁', '静安', '普陀', '闸北', 
					  '虹口', '杨浦', '闵行', '宝山', '嘉定', '浦东新区', '金山', '松江', '南汇', '奉贤', '青浦', '崇明'],

				'03':['万州', '涪陵', '渝中', '大渡口', '江北', '沙坪坝', '九龙坡', '南岸', '北碚',
				 	  '万盛', '双桥', '渝北', '巴南', '长寿', '綦江', '潼南', '铜梁', '大足', '荣昌', '璧山',
				 	  '梁平', '城口', '丰都', '垫江', '武隆', '忠县', '开县', '云阳', '奉节', '巫山', '巫溪', '黔江', '石柱',
				 	  '秀山', '酉阳', '彭水', '江津', '合川', '永川', '南川'],

				'04':['和平', '河东', '河西', '南开', '河北', '红桥', '塘沽', '汉沽', '大港',
				 	  '东丽', '西青', '津南', '北辰', '宁河', '武清', '静海', '宝坻', '蓟县'],

				'05':['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', 
				      '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '吉首', '湘西'],

				'06':['广州', '韶关', '深圳', '珠海', '汕头', '佛山', '江门', '湛江', '茂名', '顺德',
					  '潮阳', '肇庆' ,'惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞', '中山', '潮州', '揭阳', '云浮'],

			};




	//window.showCalendar1();
})