define(['angularAMD'], function(angularAMD){
	angularAMD.service('Constant', function(utility){
		this.addressMap = function(){
			var addressMap = {
			'01':['东城','西城','崇文','宣武','朝阳','丰台','石景山','海淀',
				  '门头沟','房山','通州','顺义', '昌平', '大兴', '平谷', '怀柔', '密云', '延庆'],

			'02':['黄浦', '南区', '卢湾', '徐汇', '长宁', '静安', '普陀', '闸北', 
				  '虹口', '杨浦', '闵行', '宝山', '嘉定', '浦东新区', '金山', '松江', '南汇', '奉贤', '青浦', '崇明'],

			'03':['万州', '涪陵', '渝中', '大渡口', '江北', '沙坪坝', '九龙坡', '南岸', '北碚',
			 	  '万盛', '双桥', '渝北', '巴南', '长寿', '綦江', '潼南', '铜梁', '大足', '荣昌', '璧山',
			 	  '梁平', '城口', '丰都', '垫江', '武隆', '忠县', '开县', '云阳', '奉节', '巫山', '巫溪', '黔江', '石柱',
			 	  '秀山', '酉阳', '彭水', '江津', '合川', '永川', '南川'],

			'04':['和平', '河东', '河西', '南开', '河北', '红桥', '塘沽', '汉沽', '大港',
			 	  '东丽', '西青', '津南', '北辰', '宁河', '武清', '静海', '宝坻', '蓟县'],

			'05':['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', 
			      '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '吉首', '湘西'],

			'06':['广州', '韶关', '深圳', '珠海', '汕头', '佛山', '江门', '湛江', '茂名', '顺德',
				  '潮阳', '肇庆' ,'惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞', '中山', '潮州', '揭阳', '云浮'],

			'07':['合肥', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '阜阳', '宿州', '巢湖',
			      '六安', '亳州', '池州', '宣城'],

			'08':['福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德'],

			'09':['兰州', '嘉峪关', '金昌', '白银', '天水', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏', '甘南'],

			'10':['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池', '来宾', '崇左'],

			'11':['贵阳', '六盘水', '遵义', '安顺', '兴义', '凯里', '都匀', '铜仁', '黔西南', '毕节', '黔东南', '黔南'],

			'12':['澳门'],

			'13':['海口', '三亚', '儋州', '文昌', '三沙', '琼海'],

			'14':['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', 
			      '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店', '潢川', '济源'],

			'15':['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水'],

			'16':['哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河',
			      '牡丹江', '黑河', '绥化', '大兴安岭'],

			'17':['武汉', '黄石', '十堰', '仙桃', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', 
			      '咸宁', '随州', '江汉', '天门', '潜江', '神农架', '林区', '恩施'],

			'18':['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '梅河口', '珲春', '延吉', '延边'],

			'19':['南昌', '景德镇', '萍乡', '九江', '新余', '鹰潭', '赣州', '吉安', '宜春', '抚州', '上饶'],

			'20':['南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁'],

			'21':['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛'],

			'22':['呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '海拉尔',
				  '集宁', '巴彦浩特', '乌兰浩特', '锡林浩特', '临河', '乌兰察布盟', '兴安盟', '阿拉善盟', '兴安', '锡林郭勒', '阿拉善'],

		    '23':['银川', '石嘴山', '吴忠', '固原', '中卫'],

		    '24':['西宁', '格尔木', '海东', '海北', '黄南', '海南', '果洛', '玉树', '海西'],

			'25':['太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '忻州' ,'临汾', '吕梁'],

			'26':['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂',
			      '德州', '聊城', '滨州', '菏泽'],

			'27':['西安', '铜川', '宝鸡' ,'咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛'],

			'28':['成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾',
			     '广安', '达州', '雅安', '巴中', '资阳', '阿坝', '甘孜', '凉山'],

			'29':['台湾'],

			'30':['拉萨', '昌都', '山南', '日喀则', '那曲', '阿里', '林芝'],

			'31':['香港'],

			'32':['乌鲁木齐', '克拉玛依', '奎屯','吐鲁番', '哈密', '昌吉', '博尔塔拉', '巴音郭楞', '阿克苏', '克孜勒苏',
			      '喀什', '和田', '伊犁', '塔城', '阿勒泰', '石河子', '五家渠'],

			'33':['昆明', '怒江', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '版纳',
			      '楚雄', '红河', '文山', '西双版纳', '大理', '德宏', '怒江傈', '迪庆'],

			'34':['杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '舟山', '台州', '丽水']
			};
			return addressMap;
		};

		this.Educations = function(){
			var educations = ['博士','硕士','本科','大专','高中','初中','小学'];
			return educations;
		};

		this.Incomes = function(){
			var incomes = ['<2000','2000-5000','5000-10000','10000-15000','15000-20000','20000-30000','50000以上'];
			return incomes;
		};

		this.Months = function(){
			var months = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'];
			return months;
		};

		this.generateHeightList = function(){
			var storeHeight = [];
			for(var i = 130 ; i<227; i++){
				var eachList = i+'厘米';
				storeHeight.push(eachList);
			}
			return storeHeight;
		};

		this.daysPerMonth = function(year, month){
			var days = [];
			if(month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12 ){
				var monthDays = 31;
			} else if(month == 4 || month == 6 || month == 9 || month == 11){
				var monthDays = 30;
			} else if(month == 2){
				var isLeapYear = utility.isLeapYear(year);
				if(isLeapYear){
					var monthDays = 29;
				} else {
					var monthDays = 28;
				}
			}
			for(var i = 1; i <= monthDays; i++ ){
				days.push(i);
			}
			return days;
		};

		this.getSubJobInfo = function(mainJobIndex){
			var subJobInfo = [
				["请选择"],
				["请选择","销售总监","销售经理","销售主管","销售专员","渠道/分销管理","渠道/分销专员","经销商","客户经理","客户代表","其他"],
				["请选择","客服经理","客服主管","客服专员","客服协调","客服技术支持","其他"],
				["请选择","IT技术总监","IT技术经理","IT工程师","系统管理员","测试专员","运营管理","网页设计","网站编辑","网站产品经理","其他"],
	            ["请选择","通信技术","电子技术","其他"],
	            ["请选择","工厂经理","工程师","项目主管","营运经理","营运主管","车间主任","物料管理","生产领班","操作工人","安全管理","其他"],
	            ["请选择","物理经理","物流主管","物流专员","仓库经理","仓库管理员","货运代理","集装箱业务","海关事务管理","报单员","快递员","其他"],
	            ["请选择","商务经理","商务专员","采购经理","采购专员","外贸经理","外贸专员","业务跟单","报关员","其他"],
	            ["请选择","人事总监","人事经理","人事专员","招聘经理","招聘专员","培训经理","培训专员","秘书","文员","后勤","其他"],
	            ["请选择","总经理","副总经理","合伙人","总监","经理","总裁助理","其他"],
	            ["请选择","广告客户经理","广告客户专员","广告设计经理","广告设计专员","广告策划","市场营销经理","市场营销专员","市场策划","市场调研与分析","市场拓展","公关经理","公关专员","媒介经理","媒介专员","品牌经理","品牌专员","其他"],
	            ["请选择","主编","编辑","作家","撰稿人","文案策划","出版发行","导演","记者","主持人","演员","模特","经纪人","摄影师","影视后期制作","设计师","画家","音乐家","舞蹈","其他"],
	            ["请选择","生物工程","药品生产","临床研究","医疗器械","医药代表","化工工程师","其他"],
	            ["请选择","医疗管理","医生","心理医生","药剂师","护士","其他"],
	            ["请选择","投资","保险","金融","银行","证券","其他"],
	            ["请选择","建筑师","工程师","规划师","景观设计","房地产策划","房地产交易","物业管理","其他"],
	            ["请选择","专业顾问","咨询经理","咨询师","培训师","其他"],
	            ["请选择","律师","律师助理","法务助理","法务专员","知识产权专员","其他"],
	            ["请选择","财务总监","财务经理","财务主管","会计","注册会计师","审计师","税务经理","税务专员","成本经理","其他"],
	            ["请选择","教授","讲师/助教","中学教师","小学教师","幼师","教务管理人员","职业技术教师","培训师","科研管理人员","科研人员","其他"],
	            ["请选择","餐饮管理","厨师","餐厅服务员","酒店管理","大堂经理","酒店服务员","导游","美容师","健身教练","商场经理","零售店店长","店员","保安经理","保安人员","家政服务","其他"],
	            ["请选择","飞行员","空乘人员","地勤人员","列车司机","乘务人员","船长","船员","司机","其他"],
	            ["请选择","公务员","其他"],
	            ["请选择","军人","警察","其他"],
	            ["请选择"],
	            ["请选择"],
	            ["请选择"],
	            ["请选择"],
	            ["请选择"],
	            ["请选择"]
			];

			return subJobInfo[mainJobIndex];
		};




	});
});


